import React, { FunctionComponent } from 'react';
import "./AdaptiveText.scss"

export const AdaptiveText: FunctionComponent = () => {
    return <>
        <main>
            <div className="eyebrow"></div>
            <div className="main-text">
                <div className="scroll">
                    <p>Базовые сценарии поведения пользователей освещают чрезвычайно интересные особенности картины в целом, однако конкретные выводы, разумеется, своевременно верифицированы. Также как социально-экономическое развитие способствует повышению качества системы массового участия.</p>

                    <p>Принимая во внимание показатели успешности, высококачественный прототип будущего проекта в значительной степени обусловливает важность новых принципов формирования материально-технической и кадровой базы.</p>

                    <p>Предварительные выводы неутешительны: синтетическое тестирование обеспечивает актуальность существующих финансовых и административных условий. Следует отметить, что современная методология разработки позволяет оценить значение новых принципов формирования материально-технической и кадровой базы.</p>
                </div>
            </div>
        </main>
    </>
}